Repository: chempkovsky/OpenIdDictMvcSvr
Catalog: OpenIdDictMvcLib/Resources/Localizers/ClaimLocalizerResource.*.resx
Languages: ru

source: Add
ru: Добавить

source: Are you sure you want to delete this?
ru: Вы уверены, что хотите удалить это?

source: Back to List
ru: Обратно к списку

source: Claim
ru: Заявка(Claim)

source: Claim in detail
ru: Заявка(Claim) в деталях

source: Claim property keys cannot be null or empty.
ru: Ключи свойств утверждения не могут быть нулевыми или пустыми.

source: Claims
ru: Заявки(Claims)

source: Create
ru: Создать

source: Create New
ru: Создать новую

source: Created a new Claim with type:
ru: Создана новая заявка(Claim) типа:

source: Delete
ru: Удалить

source: Delete Claim
ru: Удалить заявку(Claim)

source: Deleted a Claim with type:
ru: Создана заявка(Claim) типа:

source: Details
ru: Подробности

source: Edit
ru: Редактировать

source: Failed to add claim to role:
ru: Не удалось добавить заявку(Claim) для роли:

source: Failed to add claim to user:
ru: Не удалось добавить заявку(Claim) пользователю:

source: Failed to find role by id:
ru: Не удалось найти роль по идентификатору:

source: Failed to find user by id:
ru: Не удалось найти пользователя по идентификатору:

source: For Role with Id:
ru: Для роли с идентификатором:

source: For User with Id:
ru: Для пользователя с идентификатором:

source: Home
ru: Домашняя страница

source: New Claim
ru: Новая заявка

source: Property Key
ru: Ключ свойства

source: Property Value
ru: Значение свойства

source: Roles
ru: Роли

source: The Claim Propertie Key field is required.
ru: Поле Ключ свойства является обязательным.

source: The Claim Propertie Value field is required.
ru: Поле Значение свойства является обязательным.

source: Two Claim properties have identical key.
ru: Два свойства утверждения имеют одинаковый ключ.

source: Users
ru: Пользователи
