Repository: chempkovsky/OpenIdDictMvcSvr
Catalog: OpenIdDictMvcLib/Resources/Localizers/IdentityLocalizerResource.*.resx
Languages: ru

source: 2fa has been disabled. You can reenable 2fa when you setup an authenticator app
ru: 2fa отключен. Вы можете повторно включить 2fa при настройке приложения для аутентификации.

source: A code must be supplied for password reset.
ru: Код должен быть предоставлен для сброса пароля.

source: account
ru: учетную запись

source: account.
ru: учетную запись.

source: Add another service to log in.
ru: Добавьте еще один сервис для входа.

source: Add authenticator app
ru: Добавить приложение для проверки подлинности

source: and
ru: и

source: Applications
ru: Приложения

source: article about setting up this ASP.NET application to support logging in via external services
ru: статью о настройке этого приложения ASP.NET для поддержки входа через внешние службы

source: Associate your
ru: Свяжите свою

source: Authenticator app
ru: Приложение для аутентификации

source: Authenticator code
ru: Код аутентификатора

source: before you can log in with a recovery code.
ru: прежде чем вы сможете войти в систему с кодом восстановления.

source: building Web apps with ASP.NET Core
ru: создании веб-приложений с помощью ASP.NET Core

source: Can't create an instance of '{nameof(OidcIdentityUser)}'.
ru: Не удается создать экземпляр '{nameof(OidcIdentityUser)}'.

source: Cannot generate recovery codes for user as they do not have 2FA enabled.
ru: Невозможно сгенерировать коды восстановления для пользователя, так как у него не включена двухфакторная аутентификация.

source: Cannot generate recovery codes for user because they do not have 2FA enabled.
ru: Не удается сгенерировать коды восстановления для пользователя, так как у него не включена двухфакторная аутентификация.

source: Change email
ru: Изменить e-mail

source: Change password
ru: Изменить пароль

source: Change your account settings
ru: Измените настройки своей учетной записи

source: Click here to confirm your account
ru: Нажмите здесь, чтобы подтвердить свою учетную запись

source: click here to log in
ru: Кликните здесь чтоб войти

source: Click here to Logout
ru: Нажмите здесь, чтобы выйти

source: clicking here
ru: кликнув здесь

source: Close
ru: Закрыть

source: Code
ru: Код

source: Configure authenticator app
ru: Настроить приложение для проверки подлинности

source: Confirm email
ru: Подтвердите адрес электронной почты

source: Confirm email change
ru: Подтвердить изменение электронной почты

source: Confirm new password
ru: Подтвердите новый пароль

source: Confirm password
ru: Подтвердите пароль

source: Confirm your email
ru: Подтвердите ваш адрес электронной почты

source: Confirmation link to change email sent. Please check your email.
ru: Ссылка для подтверждения изменения электронной почты отправлена. Пожалуйста, проверьте свою электронную почту.

source: Create a new account.
ru: Создать новый аккаунт.

source: Current password
ru: Текущий пароль

source: Delete
ru: Удалить

source: Delete data and close my account
ru: Удалить данные и закрыть мой аккаунт

source: Delete Personal Data
ru: Удалить личные данные

source: Deleting this data will permanently remove your account, and this cannot be recovered.
ru: Удаление этих данных навсегда удалит вашу учетную запись, и это невозможно восстановить.

source: Disable 2FA
ru: Отключить двухфакторную аутентификацию

source: Disable two-factor authentication (2FA)
ru: Отключить двухфакторную аутентификацию (2FA)

source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
ru: Отключение 2FA не изменяет ключи, используемые в приложениях для аутентификации. Если вы хотите изменить ключ, используемый в приложении для аутентификации, вам следует

source: Don't have access to your authenticator device? You can
ru: У вас нет доступа к вашему устройству аутентификации? Вы можете

source: Download
ru: Скачать

source: Download a two-factor authenticator app like Microsoft Authenticator for
ru: Загрузите приложение для двухфакторной аутентификации, например Microsoft аутентификатор, для

source: Download Your Data
ru: Загрузите ваши данные

source: Email
ru: Электронная почта

source: enable QR code generation
ru: включить генерацию QR-кода

source: Ensure that '{nameof(OidcIdentityUser)}' is not an abstract class and has a parameterless constructor, or alternatively
ru: Убедитесь, что '{nameof(OidcIdentityUser)}' не является абстрактным классом и имеет конструктор без параметров, или альтернативно

source: Enter your email.
ru: Введите адрес электронной почты.

source: Error changing email.
ru: Ошибка при изменении электронной почты.

source: Error changing user name.
ru: Ошибка изменения имени пользователя.

source: Error confirming your email.
ru: Ошибка подтверждения электронной почты.

source: Error from external provider:
ru: Ошибка от внешнего провайдера:

source: Error loading external login information during confirmation.
ru: Ошибка при загрузке внешней информации для входа во время подтверждения.

source: Error loading external login information.
ru: Ошибка при загрузке внешней информации для входа.

source: external login provider key
ru: ключ внешнего провайдера входа в систему

source: External logins
ru: Внешние входы

source: for how to configure a real email sender. Normally this would be emailed
ru: как настроить реального отправителя электронной почты. Обычно это будет отправлено по электронной почте

source: Forget this browser
ru: Забудьте об этом браузере

source: Forgot password confirmation
ru: Подтверждение забытого пароля

source: Forgot your password?
ru: Забыли пароль?

source: generate a new set of recovery codes
ru: создать новый набор кодов восстановления

source: Generate Recovery Codes
ru: Генерация кодов восстановления

source: Generate two-factor authentication (2FA) recovery codes
ru: Создание кодов восстановления двухфакторной аутентификации (2FA)

source: Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
ru: Создание новых кодов восстановления не изменяет ключи, используемые в приложениях для проверки подлинности. Если вы хотите изменить ключ, используемый в приложении для аутентификации, вам следует

source: Google Authenticator for
ru: Google аутентификатор для

source: Hello
ru: Привет

source: Help for the user
ru: Помощь пользователю

source: Home
ru: Домашняя страница

source: Home Page
ru: Домашняя страница

source: Home1
ru: Домашняя страница

source: If you lose your device and don't have the recovery codes you will lose access to your account.
ru: Если вы потеряете свое устройство и у вас не будет кодов восстановления, вы потеряете доступ к своей учетной записи.

source: If you reset your authenticator key your authenticator app will not work until you reconfigure it.
ru: Если вы сбросите свой ключ аутентификатора, ваше приложение аутентификатора не будет работать, пока вы не перенастроите его.

source: Incorrect password.
ru: Неверный пароль.

source: into your two factor authenticator app. Spaces and casing do not matter.
ru: в ваше приложение двухфакторной аутентификации. Пробелы и рамки значения не имеют.

source: Invalid authenticator code entered for user with ID '{UserId}'.
ru: Введен неверный код проверки подлинности для пользователя с идентификатором "{UserId}".

source: Invalid authenticator code.
ru: Неверный код аутентификатора.

source: Invalid login attempt.
ru: Неверная попытка входа.

source: Invalid recovery code entered for user with ID '{UserId}'
ru: Введен неверный код восстановления для пользователя с идентификатором "{UserId}"

source: Invalid recovery code entered.
ru: Введен неверный код восстановления.

source: is not an abstract class and has a parameterless constructor, or alternatively override the external login page in
ru: не является абстрактным классом и имеет конструктор без параметров или, альтернативно, переопределяет внешнюю страницу входа в

source: Learn about
ru: Узнайте

source: Learn how to
ru: Узнайте, как

source: Locked out
ru: Заблокировано

source: Log in
ru: Aвторизоваться

source: Log in using your
ru: Войдите, используя свой

source: log in with a recovery code
ru: войти с кодом восстановления

source: Log out
ru: Выйти

source: Login
ru: Авторизоваться

source: login from your account
ru: вход со своего аккаунта

source: Manage Email
ru: Управление электронной почтой

source: Manage your account
ru: Настройте свой аккаунт

source: Manage your external logins
ru: Управляйте своими внешними логинами

source: New email
ru: Новый E-mail

source: New password
ru: Новый пароль

source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
ru: После того, как вы отсканируете QR-код или введете указанный выше ключ, ваше приложение для двухфакторной аутентификации предоставит вам уникальный код. Введите код в поле подтверждения ниже.

source: OpenId connect Server
ru: Сервер Авторизации

source: or
ru: или

source: override the register page in /Areas/Identity/Pages/Account/Register.cshtml
ru: переопределите страницу регистрации в /Areas/Identity/Pages/Account/Register.cshtml

source: Password
ru: Пароль

source: Personal data
ru: Личные данные

source: Phone number
ru: Номер телефона

source: Please check your email to confirm your account.
ru: Пожалуйста, проверьте свою электронную почту, чтобы подтвердить свою учетную запись.

source: Please confirm your account by
ru: Пожалуйста, подтвердите свой аккаунт через

source: Please confirm your account by &lt;a href='{HtmlEncoder.Default.Encode(callbackUrl)}'&gt;clicking here&lt;/a&gt;.
ru: Подтвердите свою учетную запись, <a href='{HtmlEncoder.Default.Encode(callbackUrl)}'>нажав здесь</a>.

source: Please enter an email address for this site below and click the Register button to finish logging in.
ru: Пожалуйста, введите адрес электронной почты для этого сайта ниже и нажмите кнопку Регистрация, чтобы завершить вход.

source: Please reset your password by &lt;a href='{HtmlEncoder.Default.Encode(callbackUrl)}'&gt;clicking here&lt;/a&gt;.
ru: Сбросьте свой пароль, <a href='{HtmlEncoder.Default.Encode(callbackUrl)}'>нажав здесь</a>.

source: Privacy
ru: Конфиденциальность

source: Privacy and cookie policy have not been accepted.
ru: Политика конфиденциальности и использования файлов cookie не были приняты.

source: Privacy Policy
ru: Политика Конфиденциальности

source: Profile
ru: Профиль

source: Put these codes in a safe place.
ru: Поместите эти коды в безопасное место.

source: Recovery Code
ru: Код восстановления

source: Recovery code verification
ru: Проверка кода восстановления

source: Recovery codes
ru: Коды восстановления

source: recovery codes left.
ru: из оставшихся кодов восстановления.

source: Register
ru: Зарегистрироваться

source: Register as a new user
ru: Зарегистрируйтесь как новый пользователь

source: Register confirmation
ru: Подтверждение регистрации

source: Remember me?
ru: Запомнить меня?

source: Remember this machine
ru: Запомни эту машину

source: Remove
ru: Удалить

source: Remove this
ru: Удалите

source: Resend
ru: Отправить

source: Resend email confirmation
ru: Повторно отправить подтверждение по электронной почте

source: Reset authenticator app
ru: Сбросить приложение-аутентификатор

source: Reset authenticator key
ru: Сбросить ключ аутентификатора

source: Reset password
ru: Сброс пароля

source: Reset recovery codes
ru: Сбросить коды восстановления

source: reset your authenticator keys.
ru: сбросить ключи аутентификатора.

source: Reset your password.
ru: Сбросьте пароль.

source: Roles
ru: Роли

source: Save
ru: Сохранить

source: Scan the QR Code or enter this key
ru: Отсканируйте QR-код или введите этот ключ

source: Scopes
ru: Области применения(Scopes)

source: See this
ru: См.

source: Set password
ru: Установка пароля

source: Set up authenticator app
ru: Настроить приложение для проверки подлинности

source: Set your password
ru: Введите свой пароль

source: Thank you for confirming your email change.
ru: Благодарим вас за подтверждение изменения адреса электронной почты.

source: Thank you for confirming your email.
ru: Спасибо за подтверждение вашего адреса электронной почты.

source: The Authenticator code field is required.
ru: Поле кода аутентификатора обязательно.

source: The Code field is required.
ru: Поле Код является обязательным.

source: The current browser has been forgotten. When you login again from this browser you will be prompted for your 2fa code.
ru: Текущий браузер был забыт. Когда вы снова войдете в систему из этого браузера, вам будет предложено ввести код 2fa.

source: The Current Password field is required.
ru: Поле Текущий пароль обязательно для заполнения.

source: The default UI requires a user store with email support.
ru: Для пользовательского интерфейса по умолчанию требуется хранилище пользователей с поддержкой электронной почты.

source: The Email field is not a valid e-mail address.
ru: Поле Электронная почта не является действительным адресом электронной почты.

source: The Email field is required.
ru: Поле Электронная почта обязательно.

source: The external login was added.
ru: Добавлен внешний логин.

source: The external login was not added. External logins can only be associated with one account.
ru: Внешний логин не был добавлен. Внешние логины могут быть связаны только с одной учетной записью.

source: The external login was not removed.
ru: Внешний логин не удалился.

source: The external login was removed.
ru: Внешний логин удален.

source: The New email field is required.
ru: Поле Новая электронная почта является обязательным.

source: The new password and confirmation password do not match.
ru: Новый пароль и пароль подтверждения не совпадают.

source: The New Password field is required.
ru: Поле Новый пароль обязательно.

source: The password and confirmation password do not match.
ru: Пароль и пароль подтверждения не совпадают.

source: The Password field is required.
ru: Поле Пароль обязательно.

source: The Phone number field is not correctly defined
ru: Поле Номер телефона определено неправильно.

source: The Recovery Code field is required.
ru: Поле Код восстановления обязательно.

source: The Verification Code field is required.
ru: Поле Код подтверждения обязательно для заполнения.

source: The {0} must be at least {2} and at max {1} characters long.
ru: Длина {0} должна быть не менее {2} и не более {1} символов.

source: There are no external authentication services configured.
ru: Внешние службы аутентификации не настроены.

source: these docs
ru: эти документы

source: This account has been locked out, please try again later.
ru: Эта учетная запись заблокирована, повторите попытку позже.

source: This action only disables 2FA.
ru: Это действие отключает только 2FA.

source: This app does not currently have a real email sender registered, see
ru: В настоящее время в этом приложении не зарегистрирован реальный отправитель электронной почты, см.

source: This process disables 2FA until you verify your authenticator app. If you do not complete your authenticator app configuration you may lose access to your account.
ru: Этот процесс отключает 2FA до тех пор, пока вы не подтвердите свое приложение-аутентификатор. Если вы не завершите настройку приложения для проверки подлинности, вы можете потерять доступ к своей учетной записи.

source: To use an authenticator app go through the following steps:
ru: Чтобы использовать приложение для проверки подлинности, выполните следующие действия:

source: Two-factor authentication
ru: Двухфакторная аутентификация

source: Two-factor authentication (2FA)
ru: Двухфакторная аутентификация (2FA)

source: Unable to load two-factor authentication user.
ru: Не удалось загрузить пользователя двухфакторной аутентификации.

source: Unable to load user with email '{email}'.
ru: Не удалось загрузить пользователя с электронной почтой '{email}'.

source: Unable to load user with ID
ru: Не удалось загрузить пользователя с идентификатором

source: Unable to load user with ID '{userId}'.
ru: Не удалось загрузить пользователя с идентификатором '{userId}'.

source: Unexpected error occurred deleting user.
ru: Непредвиденная ошибка при удалении пользователя.

source: Unexpected error occurred disabling 2FA.
ru: Произошла непредвиденная ошибка при отключении 2FA.

source: Unexpected error occurred loading external login info.
ru: Произошла непредвиденная ошибка при загрузке внешней информации для входа.

source: Unexpected error when trying to set phone number.
ru: Непредвиденная ошибка при попытке установить номер телефона.

source: Update password
ru: Обновить пароль

source: Use a local account to log in.
ru: Используйте локальную учетную запись для входа.

source: Use another service to log in.
ru: Используйте другой сервис для входа.

source: Use another service to register.
ru: Используйте другой сервис для регистрации.

source: Use this page to detail your site's privacy policy.
ru: Используйте эту страницу для подробной информации о политике конфиденциальности вашего сайта.

source: User account locked out.
ru: Учетная запись пользователя заблокирована.

source: User changed their password successfully.
ru: Пользователь успешно изменил свой пароль.

source: User created a new account with password.
ru: Пользователь создал новую учетную запись с паролем.

source: User created an account using {Name} provider.
ru: Пользователь создал учетную запись с помощью провайдера {Name}.

source: User Groups
ru: Группы пользователей

source: User logged in.
ru: Пользователь вошел в систему.

source: User logged out.
ru: Пользователь вышел из системы.

source: User with ID '{UserId}' account locked out.
ru: Аккаунт пользователя с идентификатором '{UserId}' заблокирован.

source: User with ID '{UserId}' asked for their personal data.
ru: Пользователь с идентификатором {UserId} запросил свои личные данные.

source: User with ID '{UserId}' deleted themselves.
ru: Пользователь с идентификатором '{UserId}' удалил себя.

source: User with ID '{UserId}' has disabled 2fa.
ru: Пользователь с идентификатором {UserId} отключил 2fa.

source: User with ID '{UserId}' has enabled 2FA with an authenticator app.
ru: Пользователь с идентификатором '{UserId}' включил двухфакторную аутентификацию с помощью приложения для проверки подлинности.

source: User with ID '{UserId}' has generated new 2FA recovery codes.
ru: Пользователь с идентификатором {UserId} создал новые коды восстановления 2FA.

source: User with ID '{UserId}' has reset their authentication app key.
ru: Пользователь с идентификатором '{UserId}' сбросил свой ключ приложения аутентификации.

source: User with ID '{UserId}' logged in with 2fa.
ru: Пользователь с идентификатором «{UserId}» вошел в систему с помощью 2fa.

source: User with ID '{UserId}' logged in with a recovery code.
ru: Пользователь с идентификатором {UserId} вошел в систему с кодом восстановления.

source: Username
ru: Имя пользователя

source: Users
ru: Пользователи

source: Verification Code
ru: Проверочный код

source: Verification code is invalid.
ru: Код подтверждения недействителен.

source: Verification email sent. Please check your email.
ru: Письмо с подтверждением отправлено. Пожалуйста, проверьте свою электронную почту.

source: Verify
ru: Проверить

source: Welcome
ru: Добро пожаловать

source: You can
ru: Ты можешь

source: You do not have a local username/password for this site. Add a local account so you can log in without an external login.
ru: У вас нет локального имени пользователя/пароля для этого сайта. Добавьте локальную учетную запись, чтобы вы могли войти в систему без внешнего входа.

source: You do not have access to this resource.
ru: У вас нет доступа к этому ресурсу.

source: You have
ru: У вас есть

source: You have 1 recovery code left.
ru: У вас остался 1 код восстановления.

source: You have generated new recovery codes.
ru: Вы сгенерировали новые коды восстановления.

source: You have no recovery codes left.
ru: У вас не осталось кодов восстановления.

source: You have requested to log in with a recovery code. This login will not be remembered until you provide an authenticator app code at log in or disable 2FA and log in again.
ru: Вы запросили вход с кодом восстановления. Этот логин не будет запомнен, пока вы не предоставите код приложения-аутентификатора при входе в систему или не отключите 2FA и не войдете снова.

source: You have successfully logged out of the application.
ru: Вы успешно вышли из приложения.

source: You must
ru: Вы должны

source: You must accept the policy before you can enable two factor authentication.
ru: Вы должны принять политику, прежде чем сможете включить двухфакторную аутентификацию.

source: You should
ru: Вам следует

source: You've successfully authenticated with
ru: Вы успешно прошли аутентификацию с помощью

source: Your account contains personal data that you have given us. This page allows you to download or delete that data.
ru: Ваша учетная запись содержит персональные данные, которые вы нам предоставили. Эта страница позволяет вам загружать или удалять эти данные.

source: Your authenticator app has been verified.
ru: Ваше приложение-аутентификатор проверено.

source: Your authenticator app key has been reset, you will need to configure your authenticator app using the new key.
ru: Ваш ключ приложения для проверки подлинности был сброшен, вам нужно будет настроить приложение для проверки подлинности с помощью нового ключа.

source: Your email is unchanged.
ru: Ваш адрес электронной почты не изменился.

source: Your login is protected with an authenticator app. Enter your authenticator code below.
ru: Ваш логин защищен приложением-аутентификатором. Введите код аутентификатора ниже.

source: Your password has been changed.
ru: Ваш пароль был изменен.

source: Your password has been reset. Please
ru: Ваш пароль был сброшен. Пожалуйста

source: Your password has been set.
ru: Ваш пароль установлен.

source: Your profile has been updated
ru: Ваш профиль был обновлен

source: {Name} logged in with {LoginProvider} provider.
ru: {Name} вошел в систему с провайдером {LoginProvider}.

source: «RUP «Belenergostroy» - holding management company»
ru: «РУП «Белэнергострой» - управляющая компания холдинга»
