Repository: chempkovsky/OpenIdDictMvcSvr
Catalog: OpenIdDictMvcLib/Resources/Localizers/OpenIddictLocalizerResource.*.resx
Languages: ru

source: &quot;The OpenID Connect request cannot be retrieved.
ru: Запрос OpenID Connect не может быть получен.

source: access to your data?
ru: доступ к вашим данным?

source: An error occurred:
ru: Произошла ошибка:

source: Are you sure you want to sign out?
ru: Вы уверены, что хотите выйти?

source: Authorization
ru: Авторизация

source: Details concerning the calling client application cannot be found.
ru: Подробности о вызывающем клиентском приложении найти невозможно.

source: Details concerning the ID of the calling client application cannot be found.
ru: Невозможно найти подробную информацию об идентификаторе вызывающего клиентского приложения.

source: Do you want to grant
ru: Вы хотите предоставить

source: email
ru: электронная почта

source: Enter the user code given by the client application:
ru: Введите код пользователя, предоставленный клиентским приложением:

source: If the two codes don't match, press &quot;No&quot; to reject the authorization demand.
ru: Если два кода не совпадают, нажмите «Нет», чтобы отклонить запрос на авторизацию.

source: Interactive user consent is required.
ru: Требуется интерактивное согласие пользователя.

source: It will act with app roles:
ru: Он будет действовать с ролями приложения:

source: It will work with the resource scopes:
ru: Он будет работать с областями ресурсов:

source: Log out
ru: Выйти

source: Make sure that the code displayed on the device is
ru: Убедитесь, что код, отображаемый на устройстве, совпадает с

source: name
ru: имя

source: No
ru: Нет

source: Ooooops, something went really bad! :(
ru: О, что-то пошло совсем не так! :(

source: Personal Data
ru: Личные данные:

source: Scope
ru: Область действия

source: Scopes requested:
ru: Запрошенные области(Scopes):

source: sub
ru: Предмет

source: Submit
ru: Принять

source: The application details cannot be found in the database.
ru: Детали приложения не могут быть найдены в базе данных.

source: The logged in user is not allowed to access this client application.
ru: Вошедшему в систему пользователю не разрешен доступ к этому клиентскому приложению.

source: The OpenID Connect request cannot be retrieved.
ru: Запрос OpenID Connect не может быть получен.

source: The specified user code is not valid. Please make sure you typed it correctly.
ru: Указанный код пользователя недействителен. Пожалуйста, убедитесь, что вы ввели его правильно.

source: The token is no longer valid.
ru: Токен больше не действителен.

source: The user details cannot be retrieved.
ru: Данные пользователя не могут быть получены.

source: The user is no longer allowed to sign in.
ru: Пользователю больше не разрешено входить в систему.

source: The user is not logged in.
ru: Пользователь не авторизован.

source: The username/password couple is invalid.
ru: Пара имя пользователя/пароль недействительна.

source: Unable to obtain Authorizations for this user and client.
ru: Невозможно получить Авторизации для данного пользователя и клиента.

source: With a link to the resource:
ru: Cо ссылкой на ресурс:

source: Yes
ru: Да

source: You have not selected any scopes
ru: Вы не выбрали ни одной области действия
