Repository: chempkovsky/OpenIdDictMvcSvr
Catalog: OpenIdDictMvcLib/Resources/Localizers/OpenIddictAppLocalizerResource.*.resx
Languages: ru

source: Add
ru: Добавить

source: Add New
ru: Добавить новое

source: address=scp:address
ru: Адрес(scp:address)

source: Application
ru: Приложение

source: Application in detail
ru: Приложение в деталях

source: Application tokens
ru: Токены приложений

source: Applications
ru: Приложения

source: Are you sure you want to delete this?
ru: Вы уверены, что хотите удалить это?

source: Authorization code=gt:authorization_code
ru: Код авторизации(gt:authorization_code)

source: Authorization=ept:authorization
ru: авторизация(ept:authorization)

source: Authorizations
ru: Разрешения(Авторизации)

source: Back to List
ru: Обратно к списку

source: Client credentials=gt:client_credentials
ru: Учетные данные клиента(gt:client_credentials)

source: code id_token token=rst:code id_token token
ru: Код Идентификатор токена Токен(rst:code id_token token)

source: code id_token=rst:code id_token
ru: Код Идентификатор токена(rst:code id_token)

source: code token=rst:code token
ru: Код Токен(rst:code token)

source: code=rst:code
ru: Код(rst:code)

source: confidential
ru: конфиденциальный(confidential)

source: Could not create new Application.
ru: Не удалось создать новое приложение.

source: Could not find Application by ID.
ru: Не удалось найти приложение по идентификатору.

source: Create
ru: Создать

source: Create New
ru: Создать новое

source: Culture language
ru: Язык культуры

source: Custom Permissions
ru: Пользовательские разрешения

source: Delete
ru: Удалить

source: Delete Application
ru: Удалить приложение

source: Detail
ru: Подробности

source: Details
ru: Подробности

source: Device Code=gt:urn:ietf:params:oauth:grant-type:device_code
ru: Код устройства(gt:urn:ietf:params:oauth:grant-type:device_code)

source: Device=ept:device
ru: Устройство(ept:device)

source: Display Name
ru: Отображаемое имя

source: Display Names
ru: Отображаемые имена

source: Edit
ru: Редактировать

source: Edit Application
ru: Редактировать Приложение

source: email=scp:email
ru: Электронная почта(scp:email)

source: Endpoints
ru: Конечные точки(Endpoints)

source: Entity set 'ApplicationDbContext.OpenIddictEntityFrameworkCoreApplication' is null.
ru: Набор сущностей «ApplicationDbContext.OpenIddictEntityFrameworkCoreApplication» имеет значение NULL.

source: explicit
ru: явный(explicit)

source: external
ru: внешний(external)

source: Filter by App Id
ru: Фильтровать по идентификатору приложения

source: Filter by Record Id
ru: Фильтровать по идентификатору записи

source: GrantTypes
ru: Типы грантов(Grant Types)

source: Home
ru: Домашняя страница

source: id_token token=rst:id_token token
ru: Идентификатор токена Токен(rst:id_token token)

source: id_token=rst:id_token
ru: Идентификатор токена(rst:id_token)

source: implicit
ru: неявный(implicit)

source: Implicit=gt:implicit
ru: Неявно(gt:implicit)

source: Incorrect URI.
ru: Неправильный URI.

source: Introspection=ept:introspection
ru: Самоанализ(ept:introspection)

source: Logout=ept:logout
ru: Выход из системы(ept:logout)

source: New Application
ru: Новое приложение

source: none=rst:none
ru: Никакой(rst:none)

source: Not all Custom Permissions UIs are populated with data.
ru: Не все UI пользовательских разрешений заполнены данными.

source: Not all Display Names are populated with correct data.
ru: Не все отображаемые имена заполнены правильными данными.

source: Not all Post Logout Redirect Uri UIs are populated with correct data.
ru: Не все пользовательские интерфейсы Uri перенаправления после выхода из системы заполнены правильными данными. Не все UI Uri перенаправления заполнены правильными данными.

source: Not all Post Logout Redirect Uris UIs are populated with data.
ru: Не все UI Uri перенаправления после выхода из системы заполнены данными.

source: Not all Redirect Uri UIs are populated with correct data.
ru: Не все UI Uri перенаправления заполнены правильными данными.

source: Not all Redirect Uris UIs are populated with data.
ru: Не все UI Uri перенаправления заполнены данными.

source: Password=gt:password
ru: Пароль(gt:password)

source: Permissions
ru: Разрешения

source: phone=scp:phone
ru: Телефон(scp:phone)

source: Post Logout Redirect Uris
ru: Uri перенаправления после выхода из системы

source: profile=scp:profile
ru: Профиль(scp:profile)

source: ProofKeyForCodeExchange=ft:pkce
ru: Ключ подтверждения для обмена кодами(ft:pkce)

source: public
ru: публичный(public)

source: Redirect Uris
ru: Uri Перенаправления

source: Refresh token=gt:refresh_token
ru: Обновить токен(gt:refresh_token)

source: ResponseTypes
ru: Типы ответов(ResponseTypes)

source: Revocation=ept:revocation
ru: Отзыв(ept:revocation)

source: roles=scp:roles
ru: Роли(scp:roles)

source: Save
ru: Сохранить

source: Scopes
ru: Области применения(Scopes)

source: Search
ru: Поиск

source: systematic
ru: систематический(systematic)

source: The Culture language field is required.
ru: Поле Язык культуры является обязательным.

source: The Custom Permissions field is required.
ru: Поле Пользовательские разрешения является обязательным.

source: The Display Name field is required.
ru: Поле Отображаемое имя является обязательным.

source: The Pos Logout Redirect Uris
ru: Uris перенаправления после выхода из системы

source: The Post Logout Redirect Uris field is required.
ru: Поле Uri перенаправления после выхода из системы является обязательным.

source: The Redirect Uris field is required.
ru: Uris перенаправления является обязательным.

source: Token=ept:token
ru: Токен(ept:token)

source: token=rst:token
ru: Токен(rst:token)
